Revit 2024 API
SlabShapeCreaseArray.Append Method
Add the item to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	SlabShapeCrease item
)
Visual Basic
Public Overridable Sub Append ( _
	item As SlabShapeCrease _
)
Visual C++
public:
virtual void Append(
	SlabShapeCrease^ item
)
Parameters
item
Type: Autodesk.Revit.DB.SlabShapeCrease
The item to be added.
See Also
SlabShapeCreaseArray Class
Autodesk.Revit.DB Namespace